tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'eqnxio/equinox'
tap 'heroku/brew'
tap 'homeport/tap'
tap 'warrensbox/tap/tfswitch'

#
# override old, shitty, or missing system defaults
#


# brew 'bash'
brew 'git'
brew 'vim'
# brew 'zsh'
# brew 'fish'
brew 'curl'

# brew "binutils"
# brew "diffutils"
brew 'moreutils'
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'grep'
# brew 'libtool'
brew 'openssl'
brew 'readline'
brew 'ncdu'
# for PHP
brew 'bison'
brew 're2c'
brew 'libgd'
brew 'bzip2'
brew 'libiconv'
brew 'tidy-html5'

brew 'nmap'
brew 'urlview'
brew 'watch'
brew 'wget'

brew 'gnupg'
brew 'pinentry-mac'

#
# convenience cli utilities
#


# CLI prompt
brew 'starship'

# curl for SMTP
brew 'swaks'

# better tui diff
brew 'icdiff'

# cat with syntax highlighting
brew 'ccat'

# symlink farm manager for dotfiles
brew 'stow'

# jump between common dirs/files
brew 'z'

# better find
brew 'fd'

# corrects previous shell command
brew 'thefuck'

# csv processor
brew 'miller'

# json processor
brew 'jq'
# create json outputs from shell
brew 'jo'

# diff yaml files
brew 'dyff'

# view data's progress through process w/ pipeviewer
brew 'pv'

# cli tool for previewing css selector output
# brew 'https://raw.githubusercontent.com/EricChiang/pup/master/pup.rb'

# pretty list dirs
brew 'tree'
brew 'broot'

# pretty ls
brew 'exa'

# colorize a bunch of unix commands
brew 'grc'

# runtime manager
brew 'asdf'

# Terminal alternative
cask 'kitty'

brew 'peco'

# self-described swiss army knife for mac; climate for mac
brew 'm-cli'

# log file navigator
brew 'lnav'

# (select &) pipe output from cli commands to clipboard
brew 'yank'

# prefix cli commands to get a notification when done
brew 'noti'

# cli tools for handling structured text
brew 'crush-tools'
# find CIDR min/max
brew 'ipcalc'

brew 'knqyf263/pet/pet'

# jump around
brew 'zoxide'


#
# vim plugin support
#


# for vim search
brew 'ack'
brew 'fzf'

# for vim tagbar plugin
brew 'universal-ctags'
brew 'gotags'

# code searching tool
brew 'the_silver_searcher'

# GH flavored markdown preview
brew 'grip'
# lint english prose
brew 'proselint'
brew 'redpen'
brew 'hadolint'


#
# programming languages (env + dep management, linting)
#


# tkinter python support
brew 'tcl-tk'
# brew 'ghc'
brew 'r'
# cask 'rstudio'
brew 'shellcheck'


#
# datastores
#


brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'


#
# security, privacy, and authentication
#


brew 'gpg'
cask 'keepassxc'
# cask 'keybase'
# cask 'nordvpn'
# brew 'wireshark'
# brew 'sslsplit'
# brew 'tcptrace'


#
# other dev tools
#

# better man pages
brew 'tldr'
# per dir env var loader
brew 'direnv'
brew 'grv'
# brew 'sops'
# brew 'graphviz'
# brew 'neofetch'
# brew 'qcachegrind'
# brew 'equinox/release-tool'
cask 'docker'
cask 'font-hack'
# favorite font; use the nerd font for devicon/glyph support
cask 'font-hack-nerd-font'
cask 'github'
brew 'gh'
cask 'visual-studio-code'
# brew 'heroku'
# cask 'dash'
# cask 'filezilla'
# cask 'google-cloud-sdk'
# brew 'tfswitch'
# brew 'awscli'
# brew 'saml2aws'
# brew 'aws-iam-authenticator'
# brew 'kubectl'
# brew 'kubectx'
# brew 'helm'
# brew 'kind'
# cask 'ngrok'
# cask 'postman'
# cask 'vagrant-manager'
# cask 'virtualbox'
# cask 'vnc-viewer'
# cask 'xquartz'
# cask 'anaconda2'
# cask 'openrefine'
# cask 'mactex'
cask 'tunnelblick'  # FOSS OpenVPN client
brew 'minio/stable/mc'

#
# productivity apps
#

# hide menubar items
cask 'vanilla'
cask 'dropbox'
cask 'caffeine'
cask 'disk-inventory-x'
# clipboard manager
cask 'flycut'
# cask 'firefox'
# cask 'zoomus'
# cask 'google-drive'
# cask 'slack'
# cask 'discord'
cask 'the-unarchiver'
cask 'rectangle' # window snapping
# set default apps for file types
brew 'duti'
# monitor network traffic
# cask 'little-snitch'
# keycast useful for dev screen sharing
# cask 'keycastr'
# screen recorder
# cask 'kap'
cask 'typora'


#
# entertainment
#

# brew 'transmission'
# cask 'calibre'
# cask 'adium'  # IRC client
# cask 'gimp'
# cask 'origin'
# cask 'plex-media-server'
# cask 'spotify'
# cask 'steam'
# cask 'vlc'
